Австралия/src/Catalogs/CompanyResources/CompanyResources.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CompanyResources</name>
  <attributes>
    <name>Capacity</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ResourceValue</name>
    <type>
      <types>CatalogRef.Teams</types>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>Schedule</name>
    <type>
      <types>CatalogRef.Calendars</types>
    </type>
  </attributes>
  <attributes>
    <name>WorkcenterType</name>
    <type>
      <types>CatalogRef.CompanyResourceTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>WorkCenterNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Австралия/src/Catalogs/CompanyResources/ObjectModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region EventHandlers

Procedure BeforeWrite(Cancel)
	
	If DataExchange.Load Then 
		Return;
	EndIf;
	
	If Not ValueIsFilled(ResourceValue) Then
		ResourceValue = Undefined;	
	EndIf;
	
EndProcedure

Procedure Filling(FillingData, FillingText, StandardProcessing)
	
	If TypeOf(FillingData) = Type("Structure") Then
		FillPropertyValues(ThisObject, FillingData);
	EndIf;
	
	If ValueIsFilled(WorkcenterType) Then
		Schedule = Common.ObjectAttributeValue(WorkcenterType, "Schedule");
	EndIf;
	
	If Capacity = 0 Then
		Capacity = 1;
	EndIf;
	
EndProcedure

Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	
	PlanningOnWorkcentersLevel = Common.ObjectAttributeValue(WorkcenterType, "PlanningOnWorkcentersLevel");
	
	If PlanningOnWorkcentersLevel = True Then
		
		UsePlanning = Constants.UseProductionPlanning.Get();
		
		If UsePlanning Then
			CheckedAttributes.Add("Capacity");
			CheckedAttributes.Add("Schedule");
		EndIf;
		
	EndIf;
	
EndProcedure

#EndRegion

#EndIf
